Repository: wli3/sdk
Catalog: src/Cli/dotnet/commands/dotnet-workload/update/xlf/LocalizableStrings.*.xlf
Languages: de, es, fr, ko, tr, zh_hans, zh_hant

# InvalidNuGetVersionRange
source: Specified version '{0}' is not a valid NuGet version range.
de: Die angegebene Version "{0}" ist kein gültiger NuGet-Versionsbereich.
es: La versión especificada "{0}" no es una gama de versiones de NuGet válida.
fr: La version spécifiée '{0}' n'est pas une plage de versions NuGet valide.
ko: 지정된 버전 '{0}'이(가) 유효한 NuGet 버전 범위가 아닙니다.
tr: Belirtilen '{0}' sürümü geçerli bir NuGet sürüm aralığı değil.
zh_hans: 指定的版本“{0}”是无效的 NuGet 版本范围。
zh_hant: 指定的版本 '{0}' 不是有效的 NuGet 版本範圍。

# LocalOptionDescription
source: Update the workload and the local workload manifest.
de: Aktualisieren Sie das Workload und das lokale Workloadmanifest.
es: Actualice la herramienta y el manifiesto de la herramienta local.
fr: Met à jour l'outil et met à jour le manifeste d'outils locaux.
ko: 도구와 로컬 도구 매니페스트를 업데이트합니다.
tr: Aracı ve yerel araç bildirimini güncelleştirin.
zh_hans: 更新工具和本地工具清单。
zh_hant: 更新工具與本機工具資訊清單。

# ManifestPathOptionDescription
source: Path to the manifest file.
de: Pfad zur Manifestdatei.
es: Ruta de acceso al archivo de manifiesto.
fr: Chemin du fichier manifeste.
ko: 매니페스트 파일 경로입니다.
tr: Bildirim dosyasının yolu.
zh_hans: 清单文件的路径。
zh_hant: 資訊清單檔的路徑。

# PackageIdArgumentDescription
source: The NuGet Package Id of the workload to update.
de: Die NuGet-Paket-ID des zu aktualisierenden Workloads.
es: El id. del paquete de NuGet que se actualizará.
fr: ID de package NuGet de l'outil à mettre à jour.
ko: 업데이트할 도구의 NuGet 패키지 ID입니다.
tr: Güncelleştirilecek aracın NuGet Paket Kimliği.
zh_hans: 要更新的工具的 NuGet 包 ID。
zh_hant: 要更新之工具的 NuGet 套件識別碼。

# SpecifyExactlyOnePackageId
source: Specify one workload Package Id to update.
de: Geben Sie eine Workloadpaket-ID für das Update an.
es: Especifique un id. de paquete de herramientas para actualizar.
fr: Spécifiez un ID de package d'outil à mettre à jour.
ko: 업데이트할 도구 패키지 ID를 하나 지정하세요.
tr: Güncelleştirilecek tek bir aracın Paketi Kimliğini belirtin.
zh_hans: 请指定一个要更新的工具包 ID。
zh_hant: 請指定一個要更新的工具套件識別碼。

# UpdateLocaWorkloadSucceededVersionNoChange
source: Workload '{0}' is up to date (version '{1}' manifest file {2}) .
de: Das Workload "{0}" ist auf dem neuesten Stand (Version {1}, Manifestdatei "{2}").
es: La herramienta "{0}" está actualizada (versión "{1}", archivo de manifiesto {2}) .
fr: L'outil '{0}' est à jour (version '{1}', fichier manifeste {2}).
ko: '{0}' 도구는 최신 버전(버전 '{1}' 매니페스트 파일 {2})입니다.
tr: '{0}' aracı güncel (sürüm '{1}' bildirim dosyası {2}).
zh_hans: 工具“{0}”是最新的(版本“{1}”清单文件 {2})。
zh_hant: 工具 '{0}' 為最新 (版本 '{1}' 資訊清單檔 {2})。

# UpdateLocaWorkloadToLowerVersion
source: The requested version {0} is lower than existing version {1} (manifest file {2}).
de: Die angeforderte Version {0} ist niedriger als die vorhandene Version {1} (Manifestdatei "{2}").
es: La versión solicitada {0} es anterior a la versión existente {1} (archivo de manifiesto {2}).
fr: La version demandée {0} est inférieure à la version existante {1} (fichier manifeste {2}).
ko: 요청된 버전 {0}이(가) 기존 버전 {1}(매니페스트 파일 {2})보다 낮습니다.
tr: İstenen sürüm ({0}) mevcut sürümünden ({1}) (bildirim dosyası {2}) düşük.
zh_hans: 请求的版本 {0} 低于现有版本 {1} (清单文件{2})。
zh_hant: 要求的版本 {0} 低於現有版本 {1} (資訊清單檔 {2})。

# UpdateLocalWorkloadSucceeded
source: Workload '{0}' was successfully updated from version '{1}' to version '{2}' (manifest file {3}).
de: Das Workload "{0}" wurde erfolgreich von Version {1} auf Version {2} aktualisiert (Manifestdatei "{3}").
es: La herramienta "{0}" se actualizó correctamente de la versión "{1}" a la versión "{2}" (archivo de manifiesto {3}).
fr: L'outil '{0}' a été correctement mis à jour de la version '{1}' à la version '{2}' (fichier manifeste {3}).
ko: '{0}' 도구가 '{1}' 버전에서 '{2}' 버전(매니페스트 파일 {3})으로 업데이트되었습니다.
tr: '{0}' aracı, '{1}' sürümünden '{2}' (bildirim dosyası {3}) sürümüne başarıyla güncelleştirildi.
zh_hans: 工具“{0}”已成功从版本“{1}”更新到版本“{2}”(清单文件 {3})。
zh_hant: 已成功將工具 '{0}' 從 '{1}' 版更新為 '{2}' 版 (資訊清單檔 {3})。

# UpdateToLowerVersion
source: The requested version {0} is lower than existing version {1}.
de: Die angeforderte Version {0} ist niedriger als die vorhandene Version {1}.
es: La versión solicitada {0} es inferior a la versión existente {1}.
fr: La version demandée {0} est inférieure à la version existante {1}.
ko: 요청된 버전 {0}이(가) 기존 버전 {1}보다 낮습니다.
tr: İstenen sürümü ({0}) mevcut sürümünden ({1}) düşük.
zh_hans: 请求的版本 {0} 低于现有版本 {1}。
zh_hant: 要求的版本 {0} 低於現有版本 {1}。

# UpdateWorkloadCommandInvalidGlobalAndLocalAndWorkloadPath
source: The local option (--local), the global option (--global), and the workload path option (--workload-path) cannot be used together. Specify only one of the options: {0}.
de: Die lokale Option (--local), die globale Option (--global) und die Workloadpfadoption (--workload-path) können nicht zusammen verwendet werden. Geben Sie nur eine der Optionen an: {0}.
es: La opción local (--local), la opción global (--global) y la opción workload path (--workload-path) no se pueden usar juntas. Especifique solo una de ellas: {0}.
fr: N'utilisez pas en même temps l'option locale (--local), l'option globale (--global) et l'option de chemin d'outil (--workload-path). Spécifiez uniquement l'une de ces options : {0}.
ko: 로컬 옵션(--local), 전역 옵션(--global), 도구 경로 옵션(--workload-path)을 함께 사용할 수 없습니다. 옵션 {0}에 대해 하나만 지정하세요.
tr: Yerel seçenek (--local), genel seçenek (--global) ve aracı yolu seçeneği (--workload-path) birlikte kullanılamaz. Seçeneklerden yalnızca birini belirtin: {0}.
zh_hans: 本地选项(--local)、全局选项(--global)和工具路径选项(--workload-path)不能一起使用。请仅指定其中一个选项: {0}。
zh_hant: 不可同時使用本機選項 (--local)、全域選項 (--global) 和工具路徑選項 (--workload-path)。請只指定其中一個選項: {0}。

# VersionOptionDescription
source: The version range of the workload package to update to.
de: Der Versionsbereich des Workloadpakets, auf das aktualisiert werden soll.
es: El intervalo de versiones del paquete herramienta al que se actualiza.
fr: Plage de versions du package d'outils à mettre à jour.
ko: 업데이트할 도구 패키지의 버전 범위입니다.
tr: Araç paketinin güncelleştirileceği sürüm aralığı.
zh_hans: 要更新到的工具包的版本范围。
zh_hant: 工具套件要更新至的版本範圍。

# CommandDescription
source: Update a global workload.
de: Hiermit aktualisieren Sie ein globales Workload.
es: Actualizar una herramienta global.
fr: Met à jour un outil global.
ko: 전역 도구를 업데이트합니다.
tr: Genel bir aracı güncelleştirin.
zh_hans: 更新全局工具。
zh_hant: 更新全域工具。

# ConfigFileOptionDescription
source: The NuGet configuration file to use.
de: Die zu verwendende NuGet-Konfigurationsdatei.
es: Archivo de configuración de NuGet que debe usarse.
fr: Fichier de configuration NuGet à utiliser.
ko: 사용할 NuGet 구성 파일입니다.
tr: Kullanılacak NuGet yapılandırma dosyası.
zh_hans: 要使用的 NuGet 配置文件。
zh_hant: 要使用的 NuGet 組態檔。

# FrameworkOptionDescription
source: The target framework to update the workload for.
de: Das Zielframework, für das das Workload aktualisiert wird.
es: La plataforma de destino para la que se actualiza la herramienta.
fr: Framework cible pour lequel l'outil doit être mis à jour.
ko: 도구를 업데이트할 대상 프레임워크입니다.
tr: Aracın güncelleştirileceği hedef çerçeve.
zh_hans: 要更新工具的目标框架。
zh_hant: 要為工具更新的目標 Framework。

# NuGetConfigurationFileDoesNotExist
source: NuGet configuration file '{0}' does not exist.
de: Die NuGet-Konfigurationsdatei "{0}" ist nicht vorhanden.
es: El archivo de configuración de NuGet "{0}" no existe.
fr: Le fichier config NuGet '{0}' n'existe pas.
ko: NuGet 구성 파일 '{0}'이(가) 없습니다.
tr: NuGet yapılandırma dosyası '{0}' yok.
zh_hans: NuGet 配置文件“{0}”不存在。
zh_hant: NuGet 組態檔 '{0}' 不存在。

# UpdateSucceeded
source: Workload '{0}' was successfully updated from version '{1}' to version '{2}'.
de: Das Workload "{0}" wurde erfolgreich von Version {1} auf Version {2} aktualisiert.
es: La herramienta "{0}" se actualizó correctamente de la versión"{1}" a la versión "{2}".
fr: L'outil '{0}' a été correctement mis à jour de la version '{1}' à la version '{2}'.
ko: '{0}' 도구가 '{1}' 버전에서 '{2}' 버전으로 업데이트되었습니다.
tr: '{0}' aracı, '{1}' sürümünden '{2}' sürümüne başarıyla güncelleştirildi.
zh_hans: 工具“{0}”已成功从版本“{1}”更新到版本“{2}”。
zh_hant: 已成功將工具 '{0}' 從 '{1}' 版更新為 '{2}' 版。

# GlobalOptionDescription
source: Update the workload in the current user's workloads directory.
de: Hiermit wird das Workload im Workloadverzeichnis des aktuellen Benutzers aktualisiert.
es: Actualiza la herramienta en el directorio de herramientas del usuario actual.
fr: Mettez à jour l'outil dans le répertoire des outils de l'utilisateur actuel.
ko: 현재 사용자의 도구 디렉터리에 있는 도구를 업데이트합니다.
tr: Geçerli kullanıcının araçlar dizinindeki aracıyı güncelleştirir.
zh_hans: 更新当前用户工具目录中的工具。
zh_hant: 更新目前使用者工具目錄中的工具。

# UpdateFullCommandNameLocalized
source: .NET update Command
de: .NET-Updatebefehl
es: Comando de actualización de .NET
fr: Commande de mise à jour .NET
ko: .NET 업데이트 명령
tr: .NET güncelleştirme Komutu
zh_hans: .NET 更新命令
zh_hant: .NET 更新命令

# UpdateWorkloadCommandNeedGlobalOrWorkloadPath
source: Specify either the global option (--global) or the workload path option (--workload-path).
de: Geben Sie entweder die globale Option (--global) oder die Workloadpfadoption (--workload-path) an.
es: Especifique la opción global (--global) o la opción de la ruta de acceso de herramientas (--workload-path).
fr: Spécifiez l'option globale (--global) ou l'option de chemin d'outil (--workload-path).
ko: 전역 옵션(-global) 또는 도구 경로 옵션(--workload-path)을 지정하세요.
tr: Genel seçeneğini (--global) veya araç yolu seçeneğini (--workload-path) belirtin.
zh_hans: 请指定全局选项(--global)或工具路径选项(--workload-path)。
zh_hant: 請指定全域選項 (--global) 或工具路徑選項 (--workload-path) 兩者之一。

# UpdateWorkloadCommandInvalidGlobalAndWorkloadPath
source: (--global) conflicts with the workload path option (--workload-path). Specify only one of the options.
de: (--global) verursacht einen Konflikt mit der Workloadpfadoption (--workload-path). Geben Sie nur eine der beiden Optionen an.
es: (--global) entra en conflicto con la opción de la ruta de acceso de herramientas (--workload-path). Especifique solo una de las opciones.
fr: (--global) est en conflit avec l'option de chemin d'outil (--workload-path). Spécifiez une seule des options.
ko: (-global)이 도구 경로 옵션(--workload-path)과 충돌합니다. 옵션 중 하나만 지정하세요.
tr: (--global), araç yolu seçeneği (--workload-path) ile çakışıyor. Seçeneklerden yalnızca birini belirtin.
zh_hans: (--global)与工具路径选项(--workload-path)冲突。请仅指定其中一种选项。
zh_hant: (--global) 與工具路徑選項 (--workload-path) 相衝突。請只要指定其中一個選項。

# WorkloadHasMultipleVersionsInstalled
source: Workload '{0}' has multiple versions installed and cannot be updated.
de: Es sind mehrere Versionen des Workloads "{0}" installiert, eine Aktualisierung ist nicht möglich.
es: La herramienta "{0}" tiene varias versiones instaladas y no se puede actualizar.
fr: Dans la mesure où plusieurs versions de l'outil '{0}' sont installées, il ne peut pas être mis à jour.
ko: '{0}' 도구는 여러 버전이 설치되어 있으며 업데이트할 수 없습니다.
tr: '{0}' aracının birden fazla sürümü yüklü ve güncelleştirilemiyor.
zh_hans: 工具“{0}”已安装多个版本，无法更新。
zh_hant: 工具 '{0}' 有多個安裝的版本，且無法更新。

# WorkloadNotInstalled
source: A workload with the package Id '{0}' could not be found. Workloads are updated using their package Id which may be different from the workload name you use when calling the workload. You can find the workload names and the corresponding package Ids for installed workloads using the command 'dotnet workload list'.
de: Ein Workload mit der Paket-ID "{0}" wurde nicht gefunden. Workloads werden unter Verwendung der zugehörigen Paket-ID aktualisiert. Diese unterscheidet sich möglicherweise vom Workloadnamen, den Sie zum Aufrufen des Workloads verwenden. Sie können die Workloadnamen und die zugehörigen Paket-IDs für installierte Workloads über den Befehl "dotnet workload list" abrufen.
es: No se encontró ninguna herramienta con el identificador de paquete "{0}". Para actualizar las herramientas se usa su identificador de paquete, que puede ser distinto del nombre de herramienta que se usa al llamarla. Para buscar los nombres de herramientas y los identificadores de paquete correspondientes de las herramientas instaladas, use el comando "dotnet workload list".
fr: L'outil ayant l'ID de package '{0}' est introuvable. Les outils sont mis à jour via leur ID de package, lequel peut être différent du nom d'outil que vous utilisez quand vous appelez ce dernier. Pour trouver les noms d'outils et les ID de package correspondants aux outils installés, utilisez la commande 'dotnet workload list'.
ko: 패키지 ID가 '{0}'인 도구를 찾을 수 없습니다. 도구를 호출할 때 사용한 도구 이름과 다를 수 있는 패키지 ID를 사용하여 도구가 업데이트되었습니다. 'dotnet workload list' 명령을 사용하여 설치된 도구의 도구 이름 및 해당 패키지 ID를 확인할 수 있습니다.
tr: '{0}' paket kimliğine sahip araç bulunamadı. Araçlar, aracı çağırırken kullandığınız araç adından farklı olabilen paket kimlikleri kullanılarak güncelleştirilir. Yüklü araçların araç adlarını ve karşılık gelen paket kimliklerini bulmak için 'dotnet workload list' komutunu kullanabilirsiniz.
zh_hans: 找不到具有包 ID“{0}”的工具。 工具是使用其包 ID 更新的，该 ID 可能 与调用工具时使用的工具名称不同。可使用 "dotnet workload list" 命令查找 已安装工具的工具名称和 对应的包 ID。
zh_hant: 找不到套件識別碼為 '{0}' 的工具。 必須使用工具的套件識別碼才能將其更新， 而該識別碼可能與您在呼叫工具時的工具名稱不同。您可以使用命令 'dotnet workload list' 來針對已安裝工具尋找工具名稱 和對應的套件識別碼。

# UpdateSucceededVersionNoChange
source: Workload '{0}' was reinstalled with the latest stable version (version '{1}').
de: Das Workload "{0}" wurde in der neuesten stabilen Version neu installiert (Version {1}).
es: La herramienta "{0}" se reinstaló con la versión estable más reciente (versión "{1}").
fr: L'outil '{0}' a été réinstallé avec la dernière version stable (version '{1}').
ko: '{0}' 도구가 안정적인 최신 버전('{1}' 버전)으로 다시 설치되었습니다.
tr: '{0}' aracı, en son kararlı sürüm (sürüm '{1}') ile yeniden yüklendi.
zh_hans: 工具“{0}”已重新安装最新稳定版本(版本“{1}”)。
zh_hant: 已使用最新穩定版本 ('{1}' 版) 來重新安裝工具 '{0}'。

# UpdateWorkloadFailed
source: Workload '{0}' failed to update due to the following:
de: Fehler beim Update des Workloads "{0}". Ursache:
es: La herramienta "{0}" no se pudo actualizar debido a lo siguiente:
fr: Échec de la mise à jour de l'outil '{0}' pour la ou les raisons suivantes :
ko: 다음으로 인해 '{0}' 도구를 업데이트하지 못했습니다.
tr: Aşağıdaki nedenlerle '{0}' aracı güncelleştirilemedi:
zh_hans: 工具“{0}”因以下原因而未能更新:
zh_hant: 由於下列原因，因此工具 '{0}' 無法更新：

# AddSourceOptionDescription
source: Add an additional NuGet package source to use during the update.
de: Hiermit wird eine weitere NuGet-Paketquelle zur Verwendung während des Updates hinzugefügt.
es: Agrega un origen de paquetes de NuGet para utilizar durante la actualización.
fr: Ajoutez une source de package NuGet supplémentaire à utiliser durant la mise à jour.
ko: 업데이트 중 사용할 추가 NuGet 패키지 소스를 추가합니다.
tr: Güncelleştirme sırasında kullanılacak ilave bir NuGet paket kaynağı ekler.
zh_hans: 添加其他要在更新期间使用的 NuGet 包源。
zh_hant: 新增於更新期間要使用的額外 NuGet 套件來源。

# WorkloadPathOptionDescription
source: The directory containing the workload to update.
de: Das Verzeichnis, das das zu aktualisierende Workload enthält.
es: El directorio que contiene la herramienta que se va a actualizar.
fr: Répertoire contenant l'outil à mettre à jour.
ko: 업데이트할 도구를 포함하는 디렉터리입니다.
tr: Güncelleştirilecek aracı içeren dizin.
zh_hans: 包含要更新的工具的目录。
zh_hant: 包含要更新之工具的目錄。
