Repository: wli3/sdk
Catalog: src/Cli/dotnet/commands/dotnet-workload/uninstall/xlf/LocalizableStrings.*.xlf
Languages: de, es, it, pl, pt_br, zh_hant

# LocalOptionDescription
source: Uninstall the workload and remove it from the local workload manifest.
de: Deinstallieren Sie das Workload, und entfernen Sie es aus dem lokalen Workloadmanifest.
es: Desinstalar la herramienta y quitarla del manifiesto de la herramienta local.
it: Disinstalla lo strumento e lo rimuove dal manifesto degli strumenti locale.
pl: Odinstaluj narzędzie i usuń je z manifestu narzędzi lokalnych.
pt_br: Desinstale a ferramenta e a remova do manifesto de ferramenta local.
zh_hant: 解除安裝該工具，並將其從本機工具資訊清單中移除。

# ManifestPathOptionDescription
source: Path to the manifest file.
de: Pfad zur Manifestdatei.
es: Ruta de acceso al archivo de manifiesto.
it: Percorso del file manifesto.
pl: Ścieżka do pliku manifestu.
pt_br: Caminho para o arquivo de manifesto.
zh_hant: 資訊清單檔的路徑。

# NoManifestFileContainPackageId
source: Cannot find a manifest file that contains package id '{0}'.
de: Eine Manifestdatei mit der Paket-ID "{0}" wurde nicht gefunden.
es: No se puede encontrar un archivo de manifiesto que contiene el id. de paquete "{0}".
it: Non è possibile trovare un file manifesto che contiene l'ID pacchetto '{0}'.
pl: Nie można odnaleźć pliku manifestu, który zawiera identyfikator pakietu „{0}”.
pt_br: Não é possível localizar um arquivo de manifesto que contém a ID de pacote '{0}'.
zh_hant: 找不到包含套件識別碼 '{0}' 的資訊清單檔案。

# PackageIdArgumentDescription
source: The NuGet Package Id of the workload to uninstall.
de: Die NuGet-Paket-ID des Workloads, das deinstalliert werden soll.
es: El id. del paquete de NuGet de la herramienta que se desinstalará.
it: ID pacchetto NuGet dello strumento da disinstallare.
pl: Identyfikator pakietu NuGet narzędzia do odinstalowania.
pt_br: A ID do pacote do NuGet da ferramenta a ser desinstalada.
zh_hant: 要解除安裝之工具的 NuGet 套件識別碼。

# CommandDescription
source: Uninstall a global workload or local workload.
de: Deinstallieren Sie ein globales oder lokales Workload.
es: Desinstalar una herramienta global o local.
it: Disinstalla uno strumento globale o locale.
pl: Odinstaluj narzędzie globalne lub lokalne.
pt_br: Desinstale uma ferramenta global ou local.
zh_hant: 解除安裝全域工具或本機工具。

# SpecifyExactlyOnePackageId
source: Specify one workload Package Id to uninstall.
de: Geben Sie eine Workloadpaket-ID für die Deinstallation an.
es: Especifique un id. de paquete de herramientas para desinstalar.
it: Specificare un ID pacchetto dello strumento da disinstallare.
pl: Określ jeden identyfikator pakietu narzędzia do odinstalowania.
pt_br: Especifique uma ID de Pacote de ferramenta a ser desinstalada.
zh_hant: 請指定一個要解除安裝的工具套件識別碼。

# GlobalOptionDescription
source: Uninstall the workload from the current user's workloads directory.
de: Hiermit wird das Workload im Workloadverzeichnis des aktuellen Benutzers deinstalliert.
es: Desinstala la herramienta del directorio de herramientas del usuario actual.
it: Disinstalla lo strumento dalla directory degli strumenti dell'utente corrente.
pl: Odinstaluj narzędzie z katalogu narzędzi bieżącego użytkownika.
pt_br: Desinstalar a ferramenta do diretório de ferramentas do usuário atual.
zh_hant: 從目前使用者的工具目錄，解除安裝工具。

# UninstallLocalWorkloadSucceeded
source: Workload '{0}' was successfully uninstalled and removed from manifest file {1}.
de: Das Workload "{0}" wurde erfolgreich deinstalliert und aus der Manifestdatei "{1}" entfernt.
es: La herramienta "{0}" se desinstaló y quitó correctamente del archivo de manifiesto {1}.
it: Lo strumento '{0}' è stato disinstallato e rimosso dal file manifesto {1}.
pl: Narzędzie „{0}” zostało pomyślnie odinstalowane i usunięte z pliku manifestu {1}.
pt_br: A ferramenta '{0}' foi desinstalada com êxito e removida do arquivo de manifesto {1}.
zh_hant: 已成功解除安裝工具 '{0}'，且已將其從資訊清單檔 {1} 中移除。

# UninstallSucceeded
source: Workload '{0}' (version '{1}') was successfully uninstalled.
de: Das Workload "{0}" (Version "{1}") wurde erfolgreich deinstalliert.
es: La herramienta "{0}" (versión "{1}") se desinstaló correctamente.
it: Lo strumento '{0}' (versione '{1}') è stato disinstallato.
pl: Pomyślnie odinstalowano narzędzie „{0}” (wersja: „{1}”).
pt_br: A ferramenta '{0}' (versão '{1}') foi desinstalada com êxito.
zh_hant: 已成功解除安裝工具 '{0}' ('{1}' 版)。

# WorkloadNotInstalled
source: A workload with the package Id '{0}' could not be found. Workloads are uninstalled using their package Id which may be different from the workload name you use when calling the workload. You can find the workload names and the corresponding package Ids for installed workloads using the command 'dotnet workload list'.
de: Ein Workload mit der Paket-ID "{0}" wurde nicht gefunden. Workloads werden unter Verwendung der zugehörigen Paket-ID deinstalliert. Diese unterscheidet sich möglicherweise vom Workloadnamen, den Sie zum Aufrufen des Workloads verwenden. Sie können die Workloadnamen und die zugehörigen Paket-IDs für installierte Workloads über den Befehl "dotnet workload list" abrufen.
es: No se encontró ninguna herramienta con el identificador de paquete "{0}". Para desinstalar las herramientas se usa su identificador de paquete, que puede ser distinto del nombre de herramienta que se usa al llamarla. Para buscar los nombres de herramientas y los identificadores de paquete correspondientes de las herramientas instaladas, use el comando "dotnet workload list".
it: Non è stato possibile trovare uno strumento con l'ID pacchetto '{0}'. Per disinstallare gli strumenti, si usa il relativo ID pacchetto che potrebbe essere diverso dal nome dello strumento usato quando si chiama lo strumento. Per trovare i nomi degli strumenti e gli ID pacchetto corrispondente per gli strumenti installati, usare il comando 'dotnet workload list'.
pl: Nie można odnaleźć narzędzia o identyfikatorze pakietu „{0}”. Narzędzia są odinstalowywane przy użyciu ich identyfikatora pakietu, który może być inny niż nazwa narzędzia używana podczas wywoływania narzędzia. Nazwy narzędzi i odpowiednie identyfikatory pakietów zainstalowanych narzędzi można znaleźć przy użyciu polecenia „dotnet workload list”.
pt_br: Não foi possível encontrar uma ferramenta com a ID '{0}' do pacote. As ferramentas são desinstaladas usando a ID do pacote que pode ser diferente do nome da ferramenta que você usa ao chamar a ferramenta. Você pode encontrar os nomes das ferramentas e as Ids de pacote correspondentes para as ferramentas instaladas usando o comando 'lista de ferramentas do dotnet'.
zh_hant: 找不到套件識別碼為 '{0}' 的工具。 必須使用工具的套件識別碼才能將其解除安裝， 而該識別碼可能與您在呼叫工具時的工具名稱不同。您可以使用命令 'dotnet workload list' 來針對已安裝工具尋找工具名稱 和對應的套件識別碼。

# WorkloadHasMultipleVersionsInstalled
source: Workload '{0}' has multiple versions installed and cannot be uninstalled.
de: Es sind mehrere Versionen von Workload "{0}" installiert, eine Deinstallation ist nicht möglich.
es: La herramienta "{0}" tiene varias versiones instaladas y no se puede desinstalar.
it: Lo strumento '{0}' non può essere disinstallato perché ne sono installate più versioni.
pl: Jest zainstalowanych wiele wersji narzędzia „{0}” i nie można go odinstalować.
pt_br: A ferramenta '{0}' tem várias versões instaladas e não pode ser desinstalada.
zh_hant: 工具 '{0}' 有多個安裝的版本，且無法解除安裝。

# FailedToUninstallWorkload
source: Failed to uninstall workload '{0}': {1}
de: Fehler beim Deinstallieren des Workloads "{0}": {1}
es: No se pudo desinstalar la herramienta "{0}": {1}
it: Non è stato possibile disinstallare lo strumento '{0}': {1}
pl: Nie można odinstalować narzędzia „{0}”: {1}
pt_br: Falha ao desinstalar a ferramenta '{0}': {1}
zh_hant: 無法將工具 '{0}' 解除安裝: {1}

# UninstallWorkloadCommandInvalidGlobalAndLocalAndWorkloadPath
source: The local option(--local), the global option (--global), the workload path option (--workload-path), can only have one at a time. Specify only one of the options: {0}.
de: Die lokale Option (--local), die globale Option (--global) und die Workloadpfadoption (--workload-path) können nicht zusammen angegeben werden. Geben Sie nur eine der Optionen an: {0}.
es: La opción local (--local), la opción global (--global) y la opción de ruta de acceso de herramienta (--workload-path), solo pueden estar una cada vez. Especifique solo una de las opciones: {0}.
it: Le opzioni locale (--local), globale (--global) e del percorso dello strumento (--workload-path) non possono essere specificate contemporaneamente. Specificare una sola di queste opzioni: {0}.
pl: Można określić tylko jedną opcję jednocześnie: opcję lokalną (--local), opcję globalną (--global) lub opcję ścieżki do narzędzia (--workload-path). Podaj tylko jedną z opcji: {0}.
pt_br: As opções local (--local), global (--global) e do caminho da ferramenta (--workload-path) só podem ocorrer uma por vez. Especifique apenas uma das opções: {0}.
zh_hant: 一次只能有一個本機選項 (--local)、全域選項 (--global)、工具路徑選項 (--workload-path)。請僅指定其中一個選項: {0}。

# InvalidWorkloadPathOption
source: Workload path '{0}' does not exist.
de: Der Workloadpfad "{0}" ist nicht vorhanden.
es: La ruta de acceso de la herramienta "{0}" no existe.
it: Il percorso '{0}' dello strumento non esiste.
pl: Ścieżka narzędzia „{0}” nie istnieje.
pt_br: O caminho da ferramenta '{0}' não existe.
zh_hant: 工具路徑 {0} 不存在。

# WorkloadPathOptionDescription
source: The directory containing the workload to uninstall.
de: Das Verzeichnis, das das zu deinstallierende Workload enthält.
es: El directorio que contiene la herramienta que se va a instalar.
it: Directory contenente lo strumento da disinstallare.
pl: Katalog zawierający narzędzie do odinstalowania.
pt_br: O diretório que contém a ferramenta a ser desinstalada.
zh_hant: 包含要解除安裝之工具的目錄。
